{
  "Stefanie Speidel": {
    "bio": "Stefanie Speidel is a professor and director at the National Center for Tumor Diseases (NCT/UCC) Dresden since 2017 as well as one of the speakers of the DFG Cluster of Excellence CeTI and the Konrad Zuse AI school SECAI. She received her PhD from Karlsruhe Institute of Technology with distinction in 2009 and had a junior research group “Computer-Assisted Surgery” from 2012 – 2016. She is a MICCAI fellow, elected board member of the MICCAI Society, and member of the German Council for Scientific Information Infrastructures. She regularly organizes workshops and challenges such as the Endoscopic Vision Challenge@MICCAI, and has served as general and program chair for major conferences like IPCAI and MICCAI. Her research focuses on machine learning for image- and robot-assisted surgery.",
    "image": "/speakers/stefanie.png"
  },
  "KC (Casey) Santosh": {
    "bio": "Prof. KC Santosh is the Chair of the Department of Computer Science (since 2020) and founding director of the AI Lab (since 2015) at the University of South Dakota (USD). He served as Graduate Program Director for seven years (2017–24) and was previously a research fellow at NIH and a PostDoc at INRIA (France). At USD, he has overseen five degree-granting programs, including six specializations and certificates, managed 15 faculty and three staff, supported ~500 students, and administered a budget of over $2.2 million, including research grants. With over $8.7 million in funding (DOD, NSF, and ED, to name a few), he has authored 10 books and 250+ research articles (such as IEEE TPAMI, IEEE TAI, and IEEE TMI). He serves as an associate editor for IEEE Trans on AI, IEEE Trans of Medical Imaging and Int J of Machine Learning & Cybernetics and leads review panels for NSF and Mitacs (Canada). He is a trained leader, having completed leadership programs such as Deans/Chairs 1.0 (CCAS, Spring 2021), Deans/Chairs 2.0 (CCAS, Summer 2024), and the President Executive Leadership Training (USD, 2021/22). He leads AI+x initiative that primarily includes curriculum innovation, South Dakota Biomedical Computation Collaborative (supported by a $6.5M award from the U.S. Department of Education) and USD’s AI symposium (IEEE). He brings extensive experience in curriculum innovation—particularly in interdisciplinary initiatives and shared governance (e.g., physics, business analytics, psychology, biology, and biomedical engineering, etc.)—as well as in program assessment and evaluation (as PEV), including ABET accreditation during the 2016/17 and 2022/23 cycles. His leadership has driven a 4,000% growth in AI enrollment at USD. His contributions have established USD as a pioneer in AI programs within the state of South Dakota. In fundraising, he secured a $2.0 million endowment to further strengthen the reputation of the department. He is a member of the NIST’s AI Safety Institute Consortium and a U.S. Speaker for AI education.",
    "image": "/speakers/santosh.png"
  }
}
